Revit 2027 API
Connector.Flow Property
 The flow of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Flow { get; }
Public ReadOnly Property Flow As Double
	Get
public:
property double Flow {
	double get ();
}
member Flow : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This connector does not support flow calculation and associated properties.
Remarks
 Instantaneous flow at this connector, calculated according to system.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace